[
  {
    "Category": "General Advice",
    "Content": "Always be honest on your resume and during interviews — integrity builds long-term trust."
  },
  {
    "Category": "General Advice",
    "Content": "Arrive early to interviews; punctuality reflects reliability and respect for others' time."
  },
  {
    "Category": "General Advice",
    "Content": "Practice answering common questions like 'Tell us a little bit about yourself' with focus and confidence."
  },
  {
    "Category": "General Advice",
    "Content": "It's okay to ask for time to think before answering a question — it shows thoughtfulness, not weakness."
  },
  {
    "Category": "General Advice",
    "Content": "Come prepared with genuine, thoughtful questions for the interviewer to demonstrate your interest and curiosity."
  },
  {
    "Category": "General Advice",
    "Content": "Inject your personality into your responses — let the interviewer see your unique character and enthusiasm."
  },
  {
    "Category": "General Advice",
    "Content": "Take your time to answer questions thoughtfully — avoid giving overly generic or rehearsed responses."
  },
  {
    "Category": "General Advice",
    "Content": "Ensure you address every part of a multi-part question. This shows active listening and comprehension."
  },
  {
    "Category": "General Advice",
    "Content": "If nervous or overwhelmed, politely ask for a moment to gather your thoughts."
  },
  {
    "Category": "General Advice",
    "Content": "Provide context when answering questions to give interviewers insight into your experience and decision-making."
  },
  {
    "Category": "General Advice",
    "Content": "Don’t hesitate to pause and take notes; this shows you’re analytical and take the conversation seriously."
  },
  {
    "Category": "General Advice",
    "Content": "Research the organization thoroughly — their mission, values, and recent updates — as well as your interviewers if possible."
  },
  {
    "Category": "General Advice",
    "Content": "Review and tailor your resume to the role, ensuring your experience aligns with what the job description asks for."
  },
  {
    "Category": "General Advice",
    "Content": "Use tools like ChatGPT to practice answering behavioral and technical questions. Write answers down and rehearse them aloud or record yourself."
  },
  {
    "Category": "General Advice",
    "Content": "Avoid sounding scripted — authenticity and engagement are key."
  },
  {
    "Category": "General Advice",
    "Content": "Customize your resume for each job you apply to, especially for large companies that use applicant tracking systems (ATS)."
  },
  {
    "Category": "General Advice",
    "Content": "Ensure your resume is ATS-friendly by using standard fonts, avoiding graphics, and incorporating keywords from the job description."
  },
  {
    "Category": "General Advice",
    "Content": "Maintain professionalism and stay solution-oriented, especially when under pressure or during technical challenges."
  },
  {
    "Category": "Techniques for Answering Questions",
    "Content": "Use the STAR method (Situation, Task, Action, Result) to structure behavioral responses clearly and effectively."
  },
  {
    "Category": "Techniques for Answering Questions",
    "Content": "Alternatively, use the 'past, present, future' structure to show growth, current relevance, and aspirations."
  },
  {
    "Category": "Techniques for Answering Questions",
    "Content": "Prepare a brief introduction slide or narrative to handle the 'Tell me about yourself' question and guide the conversation toward your strengths."
  },
  {
    "Category": "Common Interview Questions",
    "Q": "Tell us a little bit about yourself.",
    "A": "Focus on your professional journey, relevant skills, and value you bring to the role. Avoid sharing personal information like religion, age, or family unless contextually appropriate. End with a short, memorable personal touch if the tone allows. Keep it concise and confident."
  },
  {
    "Category": "Common Interview Questions",
    "Q": "Why do you want this job?",
    "A": "Do not focus on needing a job or money. Highlight how your skills align with the role and your passion for the company's mission or technology. Show you're eager to contribute and grow with the team."
  },
  {
    "Category": "Common Interview Questions",
    "Q": "What are your strengths?",
    "A": "Mention strengths relevant to the job (e.g., problem-solving, adaptability, communication) and provide a brief example of how each has helped in a professional context. Use keywords from the job description where possible."
  },
  {
    "Category": "Common Interview Questions",
    "Q": "What is your biggest weakness?",
    "A": "Choose a real but not mission-critical weakness. Explain how you recognized it and the steps you're taking to improve. Show self-awareness and commitment to growth."
  },
  {
    "Category": "Common Interview Questions",
    "Q": "How do you handle pressure and tight deadlines?",
    "A": "Share specific strategies such as breaking down tasks, setting priorities, asking for support when needed, and maintaining focus. Provide a past example if possible."
  },
  {
    "Category": "Common Interview Questions",
    "Q": "Where do you see yourself in 3–5 years?",
    "A": "Demonstrate ambition and loyalty. Express your desire to grow within the company and take on more responsibility. Research the company’s growth paths and refer to those if applicable."
  },
  {
    "Category": "Common Interview Questions",
    "Q": "How do you respond to questions on topics you have no experience with?",
    "A": "Don’t say 'I don’t know' directly. Instead, mention how you would approach learning it or relate it to something you do know. This shows a growth mindset and resourcefulness."
  },
  {
    "Category": "Common Interview Questions",
    "Q": "How would you answer personality questions like 'What animal would you be and why?'",
    "A": "These questions aim to reveal your values and self-perception. Choose traits relevant to the role — e.g., 'an owl for wisdom' or 'a dolphin for collaboration.' Be creative but purposeful."
  },
  {
    "Category": "Asking Questions as an Interviewee",
    "Content": "Always prepare 2–3 thoughtful questions to ask at the end — it shows you're invested and thinking long-term."
  },
  {
    "Category": "Asking Questions as an Interviewee",
    "Content": "Ask about growth opportunities, the team culture, and what success looks like in the first 3–6 months."
  },
  {
    "Category": "Asking Questions as an Interviewee",
    "Content": "Great question: 'What does success look like in the first 3 months?' — it sets expectations and shows initiative."
  },
  {
    "Category": "Asking Questions as an Interviewee",
    "Content": "It’s okay to ask about salary, but this is usually better suited for second or final rounds unless prompted."
  },
  {
    "Category": "Asking Questions as an Interviewee",
    "Content": "Clarify the job responsibilities early. Roles that grow dramatically beyond the original scope may be red flags."
  },
  {
    "Category": "Asking Questions as an Interviewee",
    "Content": "If the job significantly differs from what was posted or discussed, it’s okay to walk away — value alignment is crucial."
  },
  {
    "Category": "Asking Questions as an Interviewee",
    "Content": "Avoid repeating questions already answered during the interview — it can seem inattentive or disorganized."
  },
  {
    "Category": "Soft Skills (Evaluated using CAR Framework - Circumstance, Action, Result)",
    "Content": "Coachability — openness to feedback and learning."
  },
  {
    "Category": "Soft Skills (Evaluated using CAR Framework - Circumstance, Action, Result)",
    "Content": "Curiosity — eagerness to explore, learn, and improve."
  },
  {
    "Category": "Soft Skills (Evaluated using CAR Framework - Circumstance, Action, Result)",
    "Content": "Work ethic — willingness to go the extra mile consistently."
  },
  {
    "Category": "Soft Skills (Evaluated using CAR Framework - Circumstance, Action, Result)",
    "Content": "Proactivity — taking initiative without being told."
  },
  {
    "Category": "Soft Skills (Evaluated using CAR Framework - Circumstance, Action, Result)",
    "Content": "Energy — bringing positive momentum and enthusiasm to the team."
  },
  {
    "Category": "Soft Skills (Evaluated using CAR Framework - Circumstance, Action, Result)",
    "Content": "Intelligence — including emotional intelligence and ability to explain complex topics clearly."
  },
  {
    "Category": "Soft Skills (Evaluated using CAR Framework - Circumstance, Action, Result)",
    "Content": "Track record of prior success — past achievements showing potential."
  },
  {
    "Category": "Soft Skills (Evaluated using CAR Framework - Circumstance, Action, Result)",
    "Content": "Preparation — coming in informed and ready."
  },
  {
    "Category": "Soft Skills (Evaluated using CAR Framework - Circumstance, Action, Result)",
    "Content": "Adaptability — adjusting quickly to change or uncertainty."
  },
  {
    "Category": "Soft Skills (Evaluated using CAR Framework - Circumstance, Action, Result)",
    "Content": "Growth mindset — belief in your ability to improve through effort."
  },
  {
    "Category": "Soft Skills (Evaluated using CAR Framework - Circumstance, Action, Result)",
    "Content": "Communication — clarity, conciseness, and empathy in expression."
  },
  {
    "Category": "Soft Skills (Evaluated using CAR Framework - Circumstance, Action, Result)",
    "Content": "Teamwork — ability to collaborate and contribute in group settings."
  },
  {
    "Category": "JavaScript Fundamentals",
    "Content": "JavaScript is a high-level, interpreted scripting language used primarily to create interactive effects within web browsers. It supports functions, objects, dynamic typing, and event-driven programming."
  },
  {
    "Category": "JavaScript Fundamentals",
    "Content": "Key JavaScript concepts include variables (var, let, const), functions (declaration and expression), objects, arrays, loops (for, while), and conditionals (if/else, switch)."
  },
  {
    "Category": "JavaScript Fundamentals",
    "Content": "JavaScript runs in the browser (client-side), but can also be used on the server via Node.js."
  },
  {
    "Category": "Data Structures",
    "Content": "A data structure is a specialized way of organizing and storing data in a computer so it can be accessed and modified efficiently. Examples include arrays, stacks, queues, linked lists, trees, and graphs."
  },
  {
    "Category": "Data Structures",
    "Content": "Arrays in JavaScript are ordered collections of items. They can store any data type and are indexed numerically starting at 0."
  },
  {
    "Category": "Data Structures",
    "Content": "A Stack is a LIFO (Last In, First Out) data structure. You can push items to the top and pop items from the top. JavaScript arrays can simulate stacks using push() and pop()."
  },
  {
    "Category": "Sorting Algorithms",
    "Content": "Bubble Sort is a simple comparison-based algorithm that repeatedly steps through the list, compares adjacent items and swaps them if they are in the wrong order. Time complexity: O(n²)."
  },
  {
    "Category": "Sorting Algorithms",
    "Content": "Merge Sort is a divide-and-conquer algorithm that splits an array into halves, sorts them recursively, and merges the sorted halves. Time complexity: O(n log n)."
  },
  {
    "Category": "Sorting Algorithms",
    "Content": "Quick Sort is another divide-and-conquer algorithm that selects a pivot, partitions the array into elements less than and greater than the pivot, then recursively sorts the partitions. Time complexity: O(n log n) on average."
  },
  {
    "Category": "Searching Algorithms",
    "Content": "Linear Search goes through each element of a list one by one to find a target value. It is simple but inefficient for large datasets. Time complexity: O(n)."
  },
  {
    "Category": "Searching Algorithms",
    "Content": "Binary Search is an efficient algorithm for sorted arrays. It repeatedly divides the search interval in half to locate a target. Time complexity: O(log n)."
  },
  {
    "Category": "Searching Algorithms",
    "Content": "Binary Search only works on sorted arrays. If the list is unsorted, you must sort it first before using this method."
  }
]
